// TODO: エクササイズが完了した後でも、さらにいろいろなことを試してみるように進めることがあります。
// もしも全てのエクササイズが完了したと思ったら、ターミナルに`n`を入力してエンターを押してください。
// コードを修正したらエクササイズファイルはリロードされます。
// `println!`を入れたり、ターミナル上で更新された出力を確認したりしてみてください。

fn main() {
    
    println!(r#"                 _   _ _                  "#);
    println!(r#"  _ __ _   _ ___| |_| (_)_ __   __ _ ___  "#);
    println!(r#" | '__| | | / __| __| | | '_ \ / _` / __| "#);
    println!(r#" | |  | |_| \__ \ |_| | | | | | (_| \__ \   -------jp "#);
    println!(r#" |_|   \__,_|___/\__|_|_|_| |_|\__, |___/ "#);
    println!(r#"                               |___/      "#);
    println!(r#"            へようこそ！！！！！          "#);
    println!();
    println!("このエクササイズは無事にコンパイルされました。他のエクササイズにはコンパイルやロジックのエラーを含んでいます。");
    println!("コンセプトはそれらのエラーの修正やエクササイズを解くことです！");
    println!("Good luck!");
    println!();
    println!("このファイルは`exercises/00_intro/intro1.rs`にあります。確認してみてください。");
    println!("現在のエクササイズの進捗はターミナル上のプロセスバーで確認できます。");
    println!("ターミナル上のパスをクリックすればエクササイズのファイルを確認できます。");
    println!();
    println!("どうしても分からない場合には`solutions`に解答例のファイルがあるので確認してみてください。");
    println!("その他、修正点などあれば「https://github.com/sotanengel/rustlings-jp/issues」にて連絡いただければと思います。");
}
